cfg_src/gitConverter/Catalogs/ноВременныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ноВременныеБазы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кластер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ноКластеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяБазыНаСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ноСостоянияВременныхБаз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияХранилища</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииХранилища</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗанятия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоИспользований</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоОсвобождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищаКонфигураций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователяХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователяХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательХранилища</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ноПользователиХранилища</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg_src/gitConverter/Enums/ноСостоянияВременныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ноСостоянияВременныхБаз</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Свободна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Занята</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетПересоздания</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg_src/gitConverter/Catalogs/ноВременныеБазы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() И Не ЗначениеЗаполнено(Объект.Состояние) Тогда
		Объект.Состояние = Перечисления.ноСостоянияВременныхБаз.Свободна;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ЗаполнитьИмяБазыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КластерПриИзменении(Элемент)
	
	ЗаполнитьИмяБазыНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьБазу(Команда)

	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, НСтр("ru='Сначала запишите элемент.'"));
		Возврат;
	КонецЕсли;

	Результат = СоздатьБазуНаСервере();
	Если Не Результат.Успешно Тогда
		ПоказатьПредупреждение(, СтрЗаменить(НСтр("ru='Не удалось создать базу: %1'"), "%1", Результат.Описание));
		Возврат;
	КонецЕсли;

	ПоказатьОповещениеПользователя(Результат.Описание);

КонецПроцедуры

&НаКлиенте
Процедура СделатьПользователяХранилища(Команда)

	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, НСтр("ru='Сначала запишите элемент.'"));
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.Хранилище) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Не указано хранилище конфигураций.'"));
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.ИмяПользователяХранилища)
			Или НЕ ЗначениеЗаполнено(Объект.ПарольПользователяХранилища) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Укажите имя и пароль пользователя хранилища.'"));
		Возврат;
	КонецЕсли;

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеВопросаОбАдминистраторе", ЭтотОбъект);
	ПоказатьВопрос(ОповещениеОЗавершении,
		НСтр("ru='Создать пользователя хранилища с правами администратора?'"),
		РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбАдминистраторе(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Администратор = РезультатВопроса = КодВозвратаДиалога.Да;

	Результат = СделатьПользователяХранилищаНаСервере(Объект.ИмяПользователяХранилища,
		Объект.ПарольПользователяХранилища, Администратор);
	Если Не Результат.Успешно Тогда
		ТекстОшибки = СтрЗаменить(НСтр("ru='Не удалось создать пользователя хранилища: %1'"),
			"%1", Результат.Описание);
		ПоказатьПредупреждение(, ТекстОшибки);
		Возврат;
	КонецЕсли;

	ПоказатьОповещениеПользователя(Результат.Описание);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоздатьБазуНаСервере()

	Возврат ноСозданиеБазы.СоздатьБазу(Объект.Ссылка);

КонецФункции

&НаСервере
Функция СделатьПользователяХранилищаНаСервере(Знач ИмяПользователя, Знач ПарольПользователя, Знач Администратор)

	Результат = КонвертацияХранилища.ДобавитьПользователяХранилища(Объект.Ссылка, Администратор);
	Если Результат.Успешно Тогда
		// Обновляем реквизит в объекте формы, чтобы последующая запись элемента
		// не затёрла ссылку на созданного пользователя.
		Объект.ПользовательХранилища = Результат.ПользовательХранилища;
	КонецЕсли;

	Возврат Результат;

КонецФункции

&НаСервере
Процедура ЗаполнитьИмяБазыНаСервере()
	
	Транслит = СтроковыеФункцииКлиентСервер.ТранслитерироватьСтроку(Объект.Description);
	
	Префикс = "";
	Если ЗначениеЗаполнено(Объект.Кластер) Тогда
		РеквизитыКластера = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Кластер, "ПрефиксИмениБазы");
		Префикс = СтроковыеФункцииКлиентСервер.ТранслитерироватьСтроку(РеквизитыКластера.ПрефиксИмениБазы);
	КонецЕсли;
	
	ИмяБазы = Транслит;
	Если Не ПустаяСтрока(Префикс) Тогда
		Если ПустаяСтрока(Транслит) Тогда
			ИмяБазы = Префикс;
		Иначе
			ИмяБазы = Префикс + "_" + Транслит;
		КонецЕсли;
	КонецЕсли;
	
	Объект.ИмяБазыНаСервере = ИмяБазы;
	
КонецПроцедуры

#КонецОбласти
